import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root',
})
export class HomeService {
  sliderData = [
    {
      img: 'assets/carousel/group-9.png',
      title: 'متعة التعلم، وبساطة المنهج',
      par:
        'ذاكر وحل تمارين مع اكبر مدرسين في مصر لايف، وأنت في بيتك، ووفر وقت وزحمه وعدم تركيز ومتقبلش بأي مدرس علشان هو ده المتاح.',
    },
    // {
    //   img: '../../assets/carousel/group-9.png',
    //   title: 'متعة التعلم، وبساطة المنهج',
    //   par: 'ذاكر وحل تمارين مع اكبر مدرسين في مصر لايف، وأنت في بيتك، ووفر وقت وزحمه وعدم تركيز ومتقبلش بأي مدرس علشان هو ده المتاح.'
    // },
    // {
    //   img: '../../assets/carousel/group-9.png',
    //   title: 'متعة التعلم، وبساطة المنهج',
    //   par: 'ذاكر وحل تمارين مع اكبر مدرسين في مصر لايف، وأنت في بيتك، ووفر وقت وزحمه وعدم تركيز ومتقبلش بأي مدرس علشان هو ده المتاح.'
    // }
  ];

  constructor() {}
}
