import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root',
})
export class QuestionsService {
  frequentlyQuestions = {
    title: 'أسئلة متكررة',
    subTitle: 'كيف تعمل إسباو',
    par:
      'بدأ التعليم عن بعد من خلال بعض الجامعات الأوربية والأمريكية في أواخر السبعينات التي كانت تقوم بإرسال مواد تعليم مختلفة من خلال البريد للطالب، وكانت هذه المواد تشمل الكتب، شرائط التسجيل وشرائط الفيديو، كما كان الطالب بدوره يقوم بإرسال فروضه الدراسية باستخدام نفس الطريقة. وكانت هذه الجامعات يشترط حضور الطالب بنفسه لمقر الجامعة لأداء الاختبار النهائي الذي بموجبة يتم منح الشهادة للطالب. ثم تطور الأمر في أواخر الثمانينات ليتم من خلال قنوات الكابل والقنوات التليفزيونية وكانت شبكة الأخبار البريطانية رائدة في هذا المجال. وفي أوائل التسعينات ظهرت الإنترنت بقوة كوسيلة اتصال بديلة سريعة وسهلة ليحل البريد الإلكتروني محل البريد العادي في إرسال المواد الخفيفة والفروض.',
    question: [
      {
        question: 'كيف يتم التدريس؟',
        answer: 'كيف يتم التدريس؟',
        isCollapsed: true,
      },
      {
        question: 'كيف يتم التدريس؟',
        answer: 'كيف يتم التدريس؟',
        isCollapsed: true,
      },
      {
        question: 'كيف يتم التدريس؟',
        answer: 'كيف يتم التدريس؟',
        isCollapsed: true,
      },
    ],
  };
  constructor() {}
}
